# Ejercicio
Con los datos de titanic.csv
- Binariceis el campo "sex"
- Age = Media de edades en los vacios
- Survived => Cambiar el 1 por superviviente y el 0 por muerto
- Campo home.dest => Cambiar el nombre a Destino y los vacios van a ser "Desconocido"
- Calcular cuantos hombre con destino a NY murieron y cuantas mujeres

In [3]:
import pandas as pd
datos = pd.read_csv("../Datos/titanic3.csv")
datos.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
# 1
sexo = pd.get_dummies(datos.sex)
datos.drop(['sex'], inplace=True,axis=1)
datos = datos.join(sexo)
datos

,pclass,survived,name,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,female,male
0,1,1,"Allen, Miss. Elisabeth Walton",29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,0
1,1,1,"Allison, Master. Hudson Trevor",0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0,1
2,1,0,"Allison, Miss. Helen Loraine",2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
3,1,0,"Allison, Mr. Hudson Joshua Creighton",30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0,1
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,1,0
1305,3,0,"Zabour, Miss. Thamine",NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,1,0
1306,3,0,"Zakarian, Mr. Mapriededer",26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,0,1
1307,3,0,"Zakarian, Mr. Ortin",27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,0,1
1308,3,0,"Zimmerman, Mr. Leo",29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,0,1

In [5]:
# 2 En edad, los vacios añadir la media
datos.age = datos.age.fillna(datos.age.mean())
datos

,pclass,survived,name,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,female,male
0,1,1,"Allen, Miss. Elisabeth Walton",29.000000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,0
1,1,1,"Allison, Master. Hudson Trevor",0.916700,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0,1
2,1,0,"Allison, Miss. Helen Loraine",2.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
3,1,0,"Allison, Mr. Hudson Joshua Creighton",30.000000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0,1
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",14.500000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,1,0
1305,3,0,"Zabour, Miss. Thamine",29.881135,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,1,0
1306,3,0,"Zakarian, Mr. Mapriededer",26.500000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,0,1
1307,3,0,"Zakarian, Mr. Ortin",27.000000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,0,1
1308,3,0,"Zimmerman, Mr. Leo",29.000000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,0,1

In [6]:
# 3 En supervivientes cambiar 1 por vivo y 0 por muerto
datos.survived = datos.survived.astype("str")
datos.survived = datos.survived.map(lambda name: "Vivo" if name=="1" else "Muerto")
datos

,pclass,survived,name,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,female,male
0,1,Vivo,"Allen, Miss. Elisabeth Walton",29.000000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,0
1,1,Vivo,"Allison, Master. Hudson Trevor",0.916700,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0,1
2,1,Muerto,"Allison, Miss. Helen Loraine",2.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
3,1,Muerto,"Allison, Mr. Hudson Joshua Creighton",30.000000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0,1
4,1,Muerto,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,Muerto,"Zabour, Miss. Hileni",14.500000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,1,0
1305,3,Muerto,"Zabour, Miss. Thamine",29.881135,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,1,0
1306,3,Muerto,"Zakarian, Mr. Mapriededer",26.500000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,0,1
1307,3,Muerto,"Zakarian, Mr. Ortin",27.000000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,0,1
1308,3,Muerto,"Zimmerman, Mr. Leo",29.000000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,0,1

In [7]:
# 4 Campo home.dest => Cambiar el nombre a Destino y los vacios van a ser "Desconocido"
datos = datos.rename(columns={"home.dest":"destino"})
datos.destino = datos.destino.fillna("Desconocido")
datos

,pclass,survived,name,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,destino,female,male
0,1,Vivo,"Allen, Miss. Elisabeth Walton",29.000000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,0
1,1,Vivo,"Allison, Master. Hudson Trevor",0.916700,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0,1
2,1,Muerto,"Allison, Miss. Helen Loraine",2.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
3,1,Muerto,"Allison, Mr. Hudson Joshua Creighton",30.000000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0,1
4,1,Muerto,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,Muerto,"Zabour, Miss. Hileni",14.500000,1,0,2665,14.4542,NaN,C,NaN,328.0,Desconocido,1,0
1305,3,Muerto,"Zabour, Miss. Thamine",29.881135,1,0,2665,14.4542,NaN,C,NaN,NaN,Desconocido,1,0
1306,3,Muerto,"Zakarian, Mr. Mapriededer",26.500000,0,0,2656,7.2250,NaN,C,NaN,304.0,Desconocido,0,1
1307,3,Muerto,"Zakarian, Mr. Ortin",27.000000,0,0,2670,7.2250,NaN,C,NaN,NaN,Desconocido,0,1
1308,3,Muerto,"Zimmerman, Mr. Leo",29.000000,0,0,315082,7.8750,NaN,S,NaN,NaN,Desconocido,0,1

In [8]:
# Calcular cuantos hombre con destino a NY murieron y cuantas mujeres
h = len(datos[(datos.destino.map(lambda des: "NY" in des) & datos.male == 1)])
m = len(datos[(datos.destino.map(lambda des: "NY" in des) & datos.female == 1)])
print("Murieron {} Hombres y {} Mujeres con destino a NY".format(h,m))

Murieron 92 Hombres y 80 Mujeres con destino a NY